Revit 2024 API
StructuralSectionGeneralU.GetFlangeThicknessInFlangeCenter Method
 Returns thickness of flange measured in the 0.5 * (width - webThickess), sometimes used for sections with width > 300 mm.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public double GetFlangeThicknessInFlangeCenter()
Visual Basic
Public Function GetFlangeThicknessInFlangeCenter As Double
Visual C++
public:
double GetFlangeThicknessInFlangeCenter()
See Also
StructuralSectionGeneralU Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace